driver-tests/pojose/provider1/caEchos/test/doc2doc/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:caec="caEchos">
  <soapenv:Body>
    <caec:EchoDoc2DocOperation>
      <part1><Hello>Hello World</Hello></part1>
    </caec:EchoDoc2DocOperation>
  </soapenv:Body>
</soapenv:Envelope>