driver-tests/pojose/provider1/caEchos/test/str2str/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:caec="caEchos">
  <soapenv:Body>
    <caec:EchoString2StringOperation>
      <part1>Hello Johnny</part1>
    </caec:EchoString2StringOperation>
  </soapenv:Body>
</soapenv:Envelope>