driver-tests/pojose/provider1/caEchos/test/nm2void/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:caec="caEchos">
  <soapenv:Body>
    <caec:EchoNM2VoidOperation>
      <part1>nm2void</part1>
    </caec:EchoNM2VoidOperation>
  </soapenv:Body>
</soapenv:Envelope>